-- ------------------------------
-- 01. 了解SQL
-- ------------------------------

-- 1.1 数据库基础

-- 1.1.1 数据库
-- 保存有组织的数据的容器（通常是一个文件或一组文件）

-- 以某种有组织的方式存储的数据集合

-- DBMS：数据库管理系统

-- 1.1.2 表
-- 一种结构化的文件，可用来存储某种特定类型的数据

-- Schema：关于数据库和表的布局及特性的信息

-- 1.1.3 列和数据类型

-- 列：表中的一个字段

-- 数据类型：允许什么类型的数据

-- 1.1.4 行
-- 表中的一个记录

-- 1.1.5 主键
-- 一列（或几列），其值能够唯一标识表中每一行

/*
 * 条件：
 * 任意两行都不具有相同的主键值
 * 每一行都必须具有一个主键值（主键列不允许空值 NUll）
 * 主键列中的值不允许修改或更新
 * 主键值不能重用
*/

-- 1.2 什么是 SQL
-- Structured Query Language（结构化查询语言）

-- 一种专门用来与数据库沟通的语言

-- 标准：ANSI SQL
